In [2]:
import pandas as pd
import seaborn as sns

print(pd.__version__)
print(sns.__version__)

2.2.2
0.13.2

In [3]:
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [4]:
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [5]:
iris = sns.load_dataset("iris")
iris.tail(3)

     sepal_length  sepal_width  petal_length  petal_width    species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [6]:
iris.shape

(150, 5)

In [7]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

object 는 아직 확정되지 않은 data형

In [8]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

- 분석시 "min(평균)"을 확인하는게 중요하다
- std = 표준편차

In [11]:
iris.value_counts()

sepal_length  sepal_width  petal_length  petal_width  species
5.8           2.7          5.1           1.9          virginica    2
4.4           2.9          1.4           0.2          setosa       1
              3.0          1.3           0.2          setosa       1
              3.2          1.3           0.2          setosa       1
4.3           3.0          1.1           0.1          setosa       1
                                                                  ..
7.7           2.6          6.9           2.3          virginica    1
              2.8          6.7           2.0          virginica    1
              3.0          6.1           2.3          virginica    1
              3.8          6.7           2.2          virginica    1
7.9           3.8          6.4           2.0          virginica    1
Name: count, Length: 149, dtype: int64

In [12]:
iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [13]:
type(iris['species'])

pandas.core.series.Series

pandas.Series 데이터 타입 : (https://pandas.pydata.org/docs/reference/api/pandas.Series.html)

In [14]:
iris['species'].value_counts().index

Index(['setosa', 'versicolor', 'virginica'], dtype='object', name='species')

In [15]:
iris['species'].value_counts().array

<NumpyExtensionArray>
[np.int64(50), np.int64(50), np.int64(50)]
Length: 3, dtype: int64

In [17]:
iris['species'].value_counts().values

array([50, 50, 50])

In [18]:
df = iris.drop("species",axis=1)
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2

In [19]:
iris.shape, df.shape

((150, 5), (150, 4))

In [20]:
df2 = iris.drop(['sepal_length', 'sepal_width'], axis=1)
df2.head(1)

   petal_length  petal_width species
0           1.4          0.2  setosa

In [21]:
iris.shape, df.shape, df2.shape

((150, 5), (150, 4), (150, 3))

In [22]:
iris.drop(['sepal_lenth', 'sepal_width', axis=0)

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (1785608693.py, line 1)

In [27]:
df3 = iris.drop([0, 1, 2], axis=0)
df3.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
3           4.6          3.1           1.5          0.2  setosa

In [28]:
df3 = iris.drop([0, 1, 2], axis=0).reset_index(drop=True)
df3.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           4.6          3.1           1.5          0.2  setosa

In [29]:
iris.shape, df.shape, df2.shape, df3.shape

((150, 5), (150, 4), (150, 3), (147, 5))

# 파일 입출력

In [ ]:
## 파일 내보내기

In [30]:
iris.to_csv("iris.csv")

In [31]:
iris.to_csv("iris2.csv", index=False)

In [32]:
iris.to_csv("./test_data/iris.csv", index=False)

## 파일 불러오기

In [33]:
iris_df = pd.read_csv("./test_data/iris.csv")
iris_df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [34]:
kaggle_df = pd.read_csv("./kaggle/train.csv")
kaggle_df.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0
1,1,Male,43,1,28.0,0,> 2 Years,Yes,58911.0,26.0,288,1
2,2,Female,25,1,14.0,1,< 1 Year,No,38043.0,152.0,254,0
3,3,Female,35,1,1.0,0,1-2 Year,Yes,2630.0,156.0,76,0
4,4,Female,36,1,15.0,1,1-2 Year,No,31951.0,152.0,294,0

In [35]:
DATA_PATH = './kaggle/'
train = pd.read_csv(DATA_PATH + 'train.csv')
train.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

In [36]:
test = pd.read_csv(DATA_PATH + 'test.csv')
test.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228

# iloc VS loc 차이
- 강사왈 : 일단은 loc만 기억하자! (이유 : 직관적임)

In [40]:
# iris.loc(행, 열)
iris.loc[:, ['sepal_length', 'species']].head(1)

   sepal_length species
0           5.1  setosa

In [41]:
cols = ['sepal_length', 'species']
iris.loc[:,cols].head(1)

   sepal_length species
0           5.1  setosa

In [42]:
cols = ['sepal_length', 'species']
iris.loc[iris['sepal_length'] >= 7.5, cols]

     sepal_length    species
105           7.6  virginica
117           7.7  virginica
118           7.7  virginica
122           7.7  virginica
131           7.9  virginica
135           7.7  virginica

In [43]:
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [46]:
cols = ['sepal_width', 'petal_width', 'species']
iris.loc[iris['sepal_width'] >=3.5]

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
10            5.4          3.7           1.5          0.2     setosa
14            5.8          4.0           1.2          0.2     setosa
15            5.7          4.4           1.5          0.4     setosa
16            5.4          3.9           1.3          0.4     setosa
17            5.1          3.5           1.4          0.3     setosa
18            5.7          3.8           1.7          0.3     setosa
19            5.1          3.8           1.5          0.3     setosa
21            5.1          3.7           1.5          0.4     setosa
22            4.6          3.6           1.0          0.2     setosa
27            5.2          3.5           1.5          0.2     setosa
32            5.2          4.1           1.5          0.1     setosa
33            5.5          4.2           1.4          0.2     setosa
36            5.5          3.5           1.3          0.2     setosa
37            4.9          3.6           1.4          0.1     setosa
40            5.0          3.5           1.3          0.3     setosa
43            5.0          3.5           1.6          0.6     setosa
44            5.1          3.8           1.9          0.4     setosa
46            5.1          3.8           1.6          0.2     setosa
48            5.3          3.7           1.5          0.2     setosa
109           7.2          3.6           6.1          2.5  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

In [48]:
cols = ['sepal_width', 'petal_width', 'species']
iris.loc[iris['sepal_width'] >=3.5, cols].head(1)

   sepal_width  petal_width species
0          3.5          0.2  setosa

### 문제 1. 
- petal_length가 1.7이상 인 값을 조회하고, 필드명은 sepal_width, petal_length만 추출하시오
- index는 항상 초기화 시켜야 된다 => reset_index(drop=True)

In [51]:
col = ['sepal_width', 'petal_length', 'species']
result = iris.loc[iris['petal_length'] >= 1.7, cols].reset_index(drop=True)
result

     sepal_width  petal_width    species
0            3.9          0.4     setosa
1            3.8          0.3     setosa
2            3.4          0.2     setosa
3            3.3          0.5     setosa
4            3.4          0.2     setosa
..           ...          ...        ...
101          3.0          2.3  virginica
102          2.5          1.9  virginica
103          3.0          2.0  virginica
104          3.4          2.3  virginica
105          3.0          1.8  virginica

[106 rows x 3 columns]

## 다중조건
- AND 연산자 : 교집합, &
- OR 연산자 : 합집합, |

cols = ['sepal_width', 'petal_length']
result = iris.loc[(조건1) & (조건2), cols].reset_index(drop=True)
result

In [55]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[(iris['species']=='setosa') & (iris['sepal_length'] <= 5.1), cols].reset_index(drop=True)
result.shape

(36, 2)

In [54]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[(iris['species'] == 'setosa') & (iris['sepal_length'] <= 5.1), cols].reset_index(drop=True)
result.shape

(36, 2)

In [57]:
train.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0
1,1,Male,43,1,28.0,0,> 2 Years,Yes,58911.0,26.0,288,1
2,2,Female,25,1,14.0,1,< 1 Year,No,38043.0,152.0,254,0
3,3,Female,35,1,1.0,0,1-2 Year,Yes,2630.0,156.0,76,0
4,4,Female,36,1,15.0,1,1-2 Year,No,31951.0,152.0,294,0

## 테스트 1.
- Gender 가 male 인것만 조회하고, 전체 행의 갯수는?

In [75]:
result = train.loc[train['Gender'] == 'Male',:].reset_index(drop=True).shape
result

(6228134, 12)

In [62]:
train.loc[:,:].head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

In [63]:
train.loc[train['Gender'] == 'Male', :].shape

(6228134, 12)

In [64]:
result = train.loc[train['Gender'] == 'Male', :].shape

In [65]:
type(result)

tuple

In [68]:
# 데이터프레임 => tuple => int
train.loc[train['Gender'] == 'Male', :].shape[0]

6228134

## 문제2
- Vahicle_Age가 1-2 year 과 < 1 year만 추출
- isin() 연산자 활용

In [87]:
train['Vehicle_Age'].value_counts()

Vehicle_Age
1-2 Year     5982678
< 1 Year     5044145
> 2 Years     477975
Name: count, dtype: int64

In [86]:
train['Vehicle_Age'].shape

(11504798,)

In [89]:
Vehicle_Age_Values = ['1-2 Year', '< 1 Year']
train.loc[train['Vehicle_Age'].isin(Vehicle_Age_Values),:].shape

(11026823, 12)

In [80]:
s = pd.Series(['llama', 'cow', 'llama', 'beetle', 'llama',
               'hippo'], name='animal')
s.value_counts()

animal
llama     3
cow       1
beetle    1
hippo     1
Name: count, dtype: int64

In [81]:
s.isin(['cow', 'llama'])

0     True
1     True
2     True
3    False
4     True
5    False
Name: animal, dtype: bool